app/controllers/reservations_controller.rb

    def set_restaurant_table
      @restaurant = Restaurant.find(params[:restaurant_id])
      @table = @restaurant.tables.find(params[:table_id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tables".* FROM "tables" WHERE "tables"."restaurant_id" = $1 AND "tables"."id" = $2 LIMIT $3  [["restaurant_id", 1], ["id", 1], ["LIMIT", 1]]