app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "opened_at", "closed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sss"], ["opened_at", "15:40:00"], ["closed_at", "23:40:00"], ["created_at", "2020-05-21 14:40:17.679251"], ["updated_at", "2020-05-21 14:40:17.679251"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "wwwwsss"], ["updated_at", "2020-05-21 15:15:32.952228"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)